# 1. Установить Python 3.x - Done
# 2. Установить PyCharm Community - Done
''' 3. Ввести в консоле
    a. import this -
The Zen of Python, by Tim Peters
Beautiful is better than ugly.
Explicit is better than implicit.
Simple is better than complex.
Complex is better than complicated.
Flat is better than nested.
Sparse is better than dense.
Readability counts.
Special cases aren't special enough to break the rules.
Although practicality beats purity.
Errors should never pass silently.
Unless explicitly silenced.
In the face of ambiguity, refuse the temptation to guess.
There should be one-- and preferably only one --obvious way to do it.
Although that way may not be obvious at first unless you're Dutch.
Now is better than never.
Although never is often better than *right* now.
If the implementation is hard to explain, it's a bad idea.
If the implementation is easy to explain, it may be a good idea.
Namespaces are one honking great idea -- let's do more of those!
    b. import antigravity
https://xkcd.com/353/
    c. import __hello__
Hello world!
    d. from __future__ import braces
File "<input>", line 1
SyntaxError: not a chance
'''
'''4. Вывести на консоль своё имя, нарисованное 'звёздочками'

    *       *         *         *       * *********
    **      *        * *        **     ** *
    * *     *       *   *       * *   * * *
    *  *    *      *     *      *  * *  * *******
    *   *   *     *       *     *   *   * *
    *    *  *    ***********    *       * *
    *     * *   *           *   *       * *
    *      **  *             *  *       * *
    *       * *               * *       * **********
'''
print('*                 * * *********      *          *         * *')
print(' *               *  *     *         * *         *         * *')
print('  *             *   *     *        *   *        *         * *')
print('   *           *    *     *       *     *       *         * *')
print('    *         *     *     *      *       *      *         * *')
print('     *       *      *     *     ***********     *         * *')
print('      *     *       *     *    *           *    *         * *')
print('       *   *        *     *   *             *   *         * *')
print('        * *         *     *  *               *  *         * *')
print('         *          *     * *                 * ********* * *')

'''5. Написать программу, которая выводит в консоль таблицу Escape-последовательностей:

    Escape sequences
    \a      Bell (alert)
    \b      Backspace
    \n      New line
    \t      Horizontal tab
    \\      Backslash \
    \”      Double quotation mark “
    \’      Single quotation mark ‘

6. Ввести с клавиатуры два целых числа: x и y
    - Вывести на экран консоли оба числа используя только один вызов print()
    - Вычислить сумму чисел
    - Выполнить целочисленное деление
    - Найти остаток
    - Вычислить степень числа: x^y

7. Напишите программу, которая считывает три числа и выводит их сумму и произведение. Каждое число записано в
отдельной строке.

8. Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике и выводит его площадь.
Каждое число записано в отдельной строке. (S = 1 / 2 * K1 * K2)'''